dynamo_static/static_logs_10/workloada_static_load.log
0    [Thread-1] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://dynamodb.us-east-2.amazonaws.com
[OVERALL], RunTime(ms), 125594
[OVERALL], Throughput(ops/sec), 7.962163797633645
[TOTAL_GCS_Copy], Count, 29
[TOTAL_GC_TIME_Copy], Time(ms), 45
[TOTAL_GC_TIME_%_Copy], Time(%), 0.0358297370893514
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 29
[TOTAL_GC_TIME], Time(ms), 45
[TOTAL_GC_TIME_%], Time(%), 0.0358297370893514
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2.0
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 2
[CLEANUP], 95thPercentileLatency(us), 2
[CLEANUP], 99thPercentileLatency(us), 2
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 124366.948
[INSERT], MinLatency(us), 4968
[INSERT], MaxLatency(us), 4255743
[INSERT], 95thPercentileLatency(us), 587263
[INSERT], 99thPercentileLatency(us), 3934207
[INSERT], Return=OK, 1000